[{"id":"125601db-7e46-4bbe-ba2b-005f77464d27","type":"Full Time","url":"https://jobs.github.com/positions/125601db-7e46-4bbe-ba2b-005f77464d27","created_at":"Fri Jan 18 08:58:21 UTC 2019","company":"The Rock Creek Group","company_url":"https://www.therockcreekgroup.com/","location":"Washington","title":"Senior Cloud Software Engineer","description":"<p><strong>Senior Cloud Software Engineer</strong>\nOnsite or Remote, Washington, DC, us\nFull-time</p>\n<h2>Company Description</h2>\n<p>RockCreek is a leading global investment firm that applies cutting-edge technology and innovation to investments. We strive to generate returns and be at the forefront of change through public and private market investments in developed, emerging and frontier markets. Our talented team embodies a culture of curiosity, debate and a relentless drive to excel. While our core competency is investment, we value our technology as a key part of our service offerings. We prioritize providing our team and our clients best-of-breed applications and APIs to view and manage funds and portfolios across our broad range of investment offerings.</p>\n<h2>Job Description</h2>\n<p>RockCreek is looking for a Senior Cloud Software Engineer to assist in architecture and lead our development efforts of a growing set of cloud-based tools and applications. This position will report directly to our VP of Engineering and have significant influence over the architecture of RockCreek’s growing technology presence. The expectation is that the Senior Cloud Software Engineer will:</p>\n<ul>\n<li>Engage daily in the architecture of multiple applications across several platforms, ranging from SQL and NoSQL databases to web- and API-based applications</li>\n<li>Write code every day, including CloudFormation templates, Ruby and Ruby on Rails, shell scripts, Node.js, and some front-end code including JavaScript and React</li>\n<li>Interact with the RockCreek AWS estate, from starting and stopping instances, configuring AWS manages services, recommending technologies, and optimizing performance and costs of all cloud-hosted resources</li>\n</ul>\n<p>The Senior Cloud Software Engineer is a key role that will have enormous latitude and influence over RockCreek’s engineering future. This position will also serve as an execution-focused technological right-hand to the VP of Engineering. Although travel is not expected to be frequent, the Project Manager should be able to occasionally meet onsite with clients and, if not located in the Washington, D.C. area, meet with the team for in-person planning sessions.</p>\n<p><strong>Qualifications</strong></p>\n<p>Requirements:</p>\n<ul>\n<li>Previous experience building applications using RESTful APIs, ideally in Ruby on Rails, Node.js, and/or Python</li>\n<li>Experience with the following AWS services:\n<ul>\n<li>Lambda functions (preferably JavaScript and Python)</li>\n<li>CloudFormation templates</li>\n<li>Elasticsearch</li>\n<li>ElastiCache</li>\n<li>DynamoDB</li>\n<li>RDS (preferably PostgreSQL and SQL Server)</li>\n</ul>\n</li>\n<li>Bash (or equivalent) shell scripting</li>\n<li>Application development in an Agile environment, with daily standups and ticketing</li>\n<li>Experience writing user and integration tests and using continuous integration systems to automate tests as part of a version management system and process</li>\n<li>Experience with Jira or Pivotal Tracker</li>\n<li>Strong written and verbal English communication skills</li>\n</ul>\n<p>Desired Skills:</p>\n<ul>\n<li>Past application development using React and/or Vue.js, preferably in the context of single-page applications</li>\n<li>Practical experience with any of the following AWS services:\n<ul>\n<li>API Gateway</li>\n<li>Step Functions</li>\n<li>Amazon Athena</li>\n<li>Amazon Redshift</li>\n<li>AWS Glue</li>\n</ul>\n</li>\n<li>AWS and/or Google Cloud certifications (especially the Certified Solutions Architect track in AWS)</li>\n<li>Experience in investment applications or working with the investment and/or financial industry</li>\n</ul>\n<p><strong>Additional Information</strong></p>\n<p><strong>The RockCreek Environment</strong></p>\n<p>RockCreek is a collaborative environment that values openness, transparency, partnership, and knowledge sharing. In a typical day you will interact with members of all of our teams; engineering is neither siloed nor cut off from the overall RockCreek business. You should be both interested and capable of learning the investment business as it relates to design and engineering, and creatively looking to enhance the overall RockCreek service offerings.</p>\n<h2>Interested?</h2>\n<p><a href=\"https://therockcreekgroup.redirect.your-jobresponse.com/senior_cloud_software_engineer_washington/241693/V819/solliciteren\">Click here to apply!</a>.</p>\n<p><em><strong>Agency calls are not appreciated</strong></em></p>\n","how_to_apply":"<p><a href=\"https://therockcreekgroup.redirect.your-jobresponse.com/senior_cloud_software_engineer_washington/241693/V819/solliciteren\">Click here to apply!</a>.</p>\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdmhiIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--cde89c1700bc399775a548340d78d6e262a4f402/62789_20190117143938.png"},{"id":"85042ba6-71b5-4cd3-a5ab-9bbf4bb5a8a7","type":"Full Time","url":"https://jobs.github.com/positions/85042ba6-71b5-4cd3-a5ab-9bbf4bb5a8a7","created_at":"Fri Jan 18 08:36:44 UTC 2019","company":"The Rock Creek Group","company_url":"http:","location":"Washington","title":"UI/UX Designer","description":"<p><strong>UI/UX Designer</strong></p>\n<h2><strong>Company Description</strong></h2>\n<p>RockCreek is a leading global investment firm that applies cutting-edge technology and innovation to investments. We strive to generate returns and be at the forefront of change through public and private market investments in developed, emerging and frontier markets. Our talented team embodies a culture of curiosity, debate and a relentless drive to excel. While our core competency is investment, we value our technology as a key part of our service offerings. We prioritize providing our team and our clients best-of-breed applications and APIs to view and manage funds and portfolios across our broad range of investment offerings.</p>\n<h2><strong>Job Description</strong></h2>\n<p>RockCreek is looking for a UI/UX Designer to provide a meaningful connection between our internal and external application users and the applications and APIs that we are building. This role will frequently communicate with users and stakeholders of various applications, shadow their usage, construct workflows representing this usage, and deliver these as stories and wireframes to the RockCreek development team. The successful UI/UX Designer should:</p>\n<ul>\n<li>Enjoy working independently as well as communicating frequently with the engineering team and application users</li>\n<li>Model user’s behavior with wireframes and mockups using creative and modern best practices and design patterns</li>\n<li>Engage in all aspects of design and engineering, following mockups through to implementation and deployment</li>\n</ul>\n<p>The UI/UX Engineer is a key role that will have enormous latitude and influence over RockCreek’s future applications. This position will also serve as a user representative and left-hand to the VP of Engineering. Although travel is not expected to be frequent, the UI/UX Designer should be able to occasionally meet onsite with clients and, if not located in the Washington, D.C. area, meet with the team for in-person planning sessions.</p>\n<h2><strong>Qualifications</strong></h2>\n<h2>Requirements:</h2>\n<ul>\n<li>Bachelor’s Degree in design, human-computer interaction (HCI), or similar, or equivalent professional experience</li>\n<li>At least 3 years experience as an interaction or UX designer</li>\n<li>Understanding of user-centered design methods, including portfolio of sites you have designed or co-designed that demonstrate attention to user workflows in addition to static design</li>\n<li>Fluency in best practice for information architecture and design</li>\n<li>Experience with Jira or Pivotal Tracker</li>\n<li>Strong written and verbal English communication skills</li>\n</ul>\n<h2>Desired Skills:</h2>\n<ul>\n<li>Past application development using React and/or Vue.js, preferably in the context of single-page applications</li>\n<li>Practical experience performing user studies or documenting user workflows for implementation in web applications</li>\n<li>AWS or Google Cloud experience</li>\n<li>Experience in investment applications or working with the investment and/or financial industry</li>\n</ul>\n<h2><strong>Interested</strong></h2>\n<p>You can apply via  <a href=\"https://therockcreekgroup.redirect.your-jobresponse.com/ui_ux_designer_washington/241691/V819/apply\">this link!</a></p>\n<h2><strong>Additional Information</strong></h2>\n<h2><strong>The RockCreek Environment</strong></h2>\n<p>RockCreek is a collaborative environment that values openness, transparency, partnership, and knowledge sharing. In a typical day you will interact with members of all of our teams; engineering is neither siloed nor cut off from the overall RockCreek business. You should be both interested and capable of learning the investment business as it relates to design and engineering, and creatively looking to enhance the overall RockCreek service offerings.</p>\n","how_to_apply":"<p><a href=\"https://therockcreekgroup.redirect.your-jobresponse.com/ui_ux_designer_washington/241691/V819/apply\">Click here to apply!</a></p>\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdlpiIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--572f6bfc3bb371429336ed03c605e6e1cbd79472/RockCreek.png"},{"id":"4183261c-1c0a-4534-8d31-5e4f41b4bbe0","type":"Full Time","url":"https://jobs.github.com/positions/4183261c-1c0a-4534-8d31-5e4f41b4bbe0","created_at":"Tue Jan 15 11:08:42 UTC 2019","company":"Metro Markets GmbH","company_url":"https://www.metro-markets.de/en/","location":"Düsseldorf","title":"Senior JavaScript-Developer - Angular/React (m/f/d)","description":"<p>To you, coding is not just coding, but an opportunity to create awesomeness. You will develop our complex online marketplace from scratch, focusing on the platform’s frontend. Take charge of the concept build and continuous implementation of new features for our marketplace, and ensure its performance optimization by collaborating with amazing colleagues in cross-functional teams.​</p>\n<p>Join our team of passionate technologists and e-commerce specialists in our brand new tech company in Düsseldorf!</p>\n<p>You’ve got:</p>\n<p>Plenty of practical experience in frontend-development (JavaScript, HTML, CSS)</p>\n<p>Solid knowledge of modern frontend technologies (Angular, React, Vue)</p>\n<p>Some experiences in dealing with product owners and you understand the customers point of view</p>\n<p>Great analytical skills in process optimization and a customer-centered mindset</p>\n<p>We’ve got:</p>\n<p>An innovative product with an incredibly exciting tech stack</p>\n<p>A “greenfield” project – an agile environment with a start-up mentality, no bureaucracy, flat hierarchies and the courage to evaluate new approaches</p>\n<p>An international team in a modern office close to the Rhine river with a cost free parking place​</p>\n<p>If you’re not from Germany – we will help you with your visa and support you with your relocation process</p>\n<p>Discounted prices in our great canteen</p>\n","how_to_apply":"<p>Email your resume to <a href=\"mailto:jobs@metro-markets.de\">jobs@metro-markets.de</a></p>\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcjViIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3aa39f989efa6423295be2e1f9c6dffbb1aac6ed/MetroMarkets%20Xing%20(1).jpg"},{"id":"87f839b0-fc0f-42cc-a26f-207cc2e03ee3","type":"Full Time","url":"https://jobs.github.com/positions/87f839b0-fc0f-42cc-a26f-207cc2e03ee3","created_at":"Thu Jan 10 17:36:56 UTC 2019","company":"Red Caffeine","company_url":"https://www.redcaffeine.com/","location":"Lombard, IL","title":"Full Stack Developer","description":"<p><strong>PRINCIPAL RESPONSIBILITIES AND DUTIES:</strong></p>\n<p><strong>Full Stack Developer</strong></p>\n<p>Do you want to work with a group of badass designers, technologists and writers to create innovate websites and web applications?  We are seeking a strong Full Stack Developer who has a passion for building websites, single page applications, and working with API’s to make extremely fluid and functional software. You will be responsible for  building the front-end and back-end design of websites and software applications, and creating design plans for the user-facing side of applications, which controls look, feel, and function.</p>\n<p>This role will be an integral part of the Development team and you will collaborate with  designers, marketers, and the entire company to solve problems and achieve meaningful results. As our team’s first full time Full Stack Developer, you will be expected to pick things up quickly, work efficiently, and contribute to the direction and future of our Development team. You’ll work on multiple client accounts in varying industries. You will have the opportunity to make a big impact both for your clients and on the company. Red Caffeine takes pride in making sure every team member’s voice is heard  and that everyone has the ability to shape their and the company’s growth path.</p>\n<p><strong>Who You Are</strong></p>\n<p>People with a strong desire to learn a multitude of technologies and programming languages with a can-do attitude will thrive in this role. You  are a problem-solver who can work in a fast-paced, collaborative office environments alongside other engineers and developers.</p>\n<p><strong>Position Responsibilities Include:</strong></p>\n<ul>\n<li>Plan and develop websites and web applications</li>\n<li>Create software solutions</li>\n<li>Architect and implement solutions to complex client systems</li>\n<li>Maintain quality and ensure responsiveness of applications</li>\n<li>Collaborate with the rest of the team to design and launch new features</li>\n<li>Maintain code integrity and organization</li>\n<li>Work with databases; both maintaining, creating, and configuring them</li>\n<li>Code in various programming languages especially .NET and JavaScript</li>\n<li>Take low fidelity mockups and turn them into fully functioning end products and components</li>\n<li>Develop immersive experiences for both mobile and desktop applications</li>\n</ul>\n<p><strong>Requirements &amp; Bonus Points:</strong></p>\n<ul>\n<li>Degree in Information Sciences, Computer Science, MIS, or related field of study (Experience/Portfolio can suffice)</li>\n<li>3+ years of application development and maintenance experience in a professional work environment</li>\n<li>Highly skilled, detail oriented Developer well versed in Object Oriented Programming &amp; best practices</li>\n<li>Expertise with HTML5/SCSS/Javascript</li>\n<li>Experience in a back-end language such as Java, C++, etc. - C# preferred</li>\n<li>Experience with SQL queries and relational modeling/databases (RESTful API, MS SQL, etc.)</li>\n<li>Experience with .NET &amp; Visual Studio - a compatible CMS is a plus</li>\n<li>Experience with Umbraco or Razor is a huge plus</li>\n<li>Experience building real-world web application software and SPA’s</li>\n<li>Experience with at least one front-end application framework such as Angular, React, or Vue</li>\n<li>Expertise in reasoning about and cleaning data</li>\n<li>Meticulous attention to detail</li>\n<li>Great communication and organizational skills</li>\n<li>Understanding of security and data protection</li>\n<li>Working knowledge of code versioning tools (Git, DevOps, SVN)</li>\n<li>Understands how to manage/estimate time and deliver projects on schedule</li>\n<li>Experience with testing tools is a plus, but not required such as Jest, Jasmine, etc.</li>\n<li>Any experience with Data Visualization tools or analytics dash-boarding is a bonus</li>\n</ul>\n<p><strong>Perks:</strong></p>\n<ul>\n<li>Medical, dental, and vision benefits</li>\n<li>401k matching</li>\n<li>Complete freedom to explore and implement new technology ideas and solutions</li>\n<li>Work with a small group of dedicated Tech/Digital focused individuals who share your passion for technology</li>\n<li>Craft coffee and beer</li>\n<li>Ping pong matches at will</li>\n<li>Flex-Time</li>\n<li>Work from home opportunities</li>\n<li>Transparent company financials</li>\n<li>Office dogs</li>\n<li>Complimentary beverages and snacks</li>\n<li>Work with a group of Badasses</li>\n</ul>\n\n<p>Red Caffeine is an Equal Opportunity Employer\nMust be able to pass pre-employment, post offer background checks\nPrincipals only. Recruiters, please do not contact.</p>\n","how_to_apply":"<p>Please apply directly on our companies Hiring platform here: <a href=\"https://redcaffeine.bamboohr.com/jobs/view.php?id=35\">https://redcaffeine.bamboohr.com/jobs/view.php?id=35</a></p>\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb1ZiIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--08f30f42b97ad5655420ad91786df6e31dfbd218/RC-GC-Logo-Small-325px-01.png"},{"id":"5e6a7cef-a571-41e7-a063-a695281d86ca","type":"Full Time","url":"https://jobs.github.com/positions/5e6a7cef-a571-41e7-a063-a695281d86ca","created_at":"Wed Jan 02 14:44:05 UTC 2019","company":"Jun Group","company_url":"https://www.jungroup.com/","location":"New York, NY","title":"Senior Software Engineer, Server-Side Technologies","description":"<p>The word JUN means truth, and our culture is about openness and honesty. Our mobile ad platform delivers millions of engagements across devices for clients like Intel, LG, Zynga, EA, and TechCrunch. These brands rely on us to reach their audience because everything we do is brand safe, viewable, and transparent.</p>\n<p>We are looking for a senior software engineer to join our amazing server team. This position is full-time, on-site in our New York headquarters, and will report to the Director of Server Software Development. Jun Group will only consider candidates for this position who are currently legally authorized to work in the United States.</p>\n<p>Who you are</p>\n<ul>\n<li>You enjoy a fun, creative, and engaging working atmosphere free of brilliant jerks</li>\n<li>You want to be part of a small team inside a large company with massive opportunity for growth</li>\n<li>You enjoy collaboration with other teams including product, biz dev, and our in-house QA team</li>\n<li>You eagerly dig into complex engineering problems</li>\n</ul>\n<p>What we do</p>\n<ul>\n<li>Write scalable back-end and front-end code in JRuby, Java, and JavaScript</li>\n<li>Experiment with new tech to find the right tool for the job</li>\n<li>Maintain high code quality through code reviews and automated tests</li>\n<li>Use Kanban to manage multiple releases per week</li>\n<li>Participate in and improve Dev Ops for our primary revenue generating applications</li>\n</ul>\n<p>How we do it</p>\n<ul>\n<li>Ruby/Rails</li>\n<li>JavaScript (JQuery, AngularJS, Vue.js)</li>\n<li>IntelliJ IDEA / TeamCity</li>\n<li>AWS (EC2, EB, RDS)</li>\n<li>Google Cloud (BiqQuery, Dataflow, Cloud Functions)</li>\n<li>MySQL</li>\n</ul>\n<p>What we offer</p>\n<ul>\n<li>A highly competitive compensation package</li>\n<li>401k with company match</li>\n<li>Paid vacation, work from home, and sick days</li>\n<li>Annual personal development budget to attend a conference of your choice</li>\n<li>Designated time to work on the company-related projects you feel strongly about</li>\n<li>Macbook Pros, dual monitors, and a quiet working space</li>\n<li>Catered lunch at least once a week</li>\n<li>Monthly company events\n </li>\n</ul>\n<p>Jun Group sets the standard for premium online advertising. We work hard, and we have lives, too. We'll pay top dollar for the right person, and there are plenty of perks. Interested parties should send a resume along with a cover note explaining why you’re right for the job.</p>\n<p>Total compensation is based on experience. We welcome diversity and non-traditional paths into the developer profession, and advocate strongly for hiring the right person as opposed to the right combination of keywords.</p>\n","how_to_apply":"<p><a href=\"https://boards.greenhouse.io/jungroup/jobs/4096629002\">https://boards.greenhouse.io/jungroup/jobs/4096629002</a></p>\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdjlhIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--2b01d792ffd9e54b5794486dd21b5ea49fea83bb/Jun-Logo.png"},{"id":"919ab7fb-79e7-4fb8-8da8-812131db1929","type":"Full Time","url":"https://jobs.github.com/positions/919ab7fb-79e7-4fb8-8da8-812131db1929","created_at":"Fri Dec 21 16:12:07 UTC 2018","company":"Mount Sinai Health System","company_url":"https://careers.mountsinai.org/","location":"New York, New York","title":"Lead Applications Developer – Scientific Computing","description":"<p>Lead Applications Developer – Scientific Computing</p>\n<p>Strength Through Diversity</p>\n<p>Ground breaking science. Advancing medicine. Healing made personal.</p>\n<p>Roles &amp; Responsibilities:\nThe Lead Applications Developer of Scientific Computing designs and develops applications, provides supervision and coordination, directs and checks the work of other software developers. Specific responsibilities are listed below.</p>\n<ul>\n<li>Develop scalable and reliable software</li>\n<li>Supervises, assists, directs and checks the work of other developers. Develops a timeline and milestones for software programming projects</li>\n<li>Assumes the responsibility for coordinating the activities of software programming with the other groups</li>\n<li>Assists management in determining computer systems requirements. Propose system and software designs to meet user requirements</li>\n<li>Develop and monitor metrics to assess the quality of the software and production services</li>\n<li>Assist with the development of user surveys to actively solicit and respond to user feedback</li>\n<li>May perform management functions in the absence of the manager and may act as a project manager/leader</li>\n<li>Develop specifications for complex front-end software applications for web services such as a cohort query tool for a data warehouse, a research application portal, and other back end services</li>\n<li>Analyze user requirements and envision system features and functionality</li>\n<li>Plan, design, implement, troubleshoot and maintain software applications. Set expectations on features and priorities throughout the development life cycle</li>\n<li>Complete application development by coordinating requirements, schedules and other activities</li>\n<li>Troubleshoot development and production problems across multiple environments and operating platforms</li>\n<li>Create documentation for all software</li>\n<li>Design and conduct tests for the software. Assess software performance and troubleshoot end-to-end issues</li>\n<li>Evaluate approaches and technologies and propose alternatives. Recommend solutions by comparing advantages and disadvantages of custom development and purchase alternatives</li>\n<li>Follow best practices for software development</li>\n<li>May be involved in providing assistance and training to other programmers</li>\n<li>Enhance organization reputation by accepting ownership for accomplishing new and different requests. Resolve conflicting requirements by proposing alternatives</li>\n<li>Update job knowledge by researching new technologies and software products and languages, reading professional publications, maintaining personal networks and participating in professional organizations. Keeps abreast of hardware and software developments, including theory and technique</li>\n</ul>\n<p>Requirements:</p>\n<ul>\n<li>Bachelor’s degree in Computer Science or a related discipline</li>\n<li>Minimum seven years of experience in programming with increasing administrative and leadership responsibilities, or an equivalent combination of education and work experience</li>\n<li>Knowledge and experience in ASP.NET, C#, SQL, and IIS is required</li>\n<li>Database administration experience is a strong plus. MS SQL Server or Oracle preferred</li>\n<li>MS SSRS experience is a plus</li>\n<li>Knowledge and experience in high level languages such as Java, PHP, JavaScript and frameworks/libraries such as Vue, Laravel, and JQuery is a strong plus</li>\n<li>JBoss/Wildfly and nginx experience is a strong plus. Tomcat and Apache experience is a plus</li>\n<li>Must have experience and ability to write complex, clean software</li>\n<li>Must be flexible in considering and learning all technology options (tools, methods, programming languages)</li>\n<li>The ability to communicate effectively and manage multiple conflicting priorities simultaneously</li>\n</ul>\n<p>Strength Through Diversity</p>\n<p>The Mount Sinai Health System believes that diversity is a driver for excellence. We share a common devotion to delivering exceptional patient care. Yet we’re as diverse as the city we call home- culturally, ethically, in outlook and lifestyle. When you join us, you become a part of Mount Sinai’s unrivaled record of achievement, education and advancement as we revolutionize medicine together.</p>\n<p>We work hard to acquire and retain the best people, and to create a welcoming, nurturing work environment where you can develop professionally. We share the belief that all employees, regardless of job title or expertise, can make an impact on quality patient care.</p>\n<p>Explore more about this opportunity and how you can help us write a new chapter in our story!</p>\n<p>Who We Are</p>\n<p>Over 38,000 employees strong, the mission of the Mount Sinai Health System is to provide compassionate patient care with seamless coordination and to advance medicine through unrivaled education, research, and outreach in the many diverse communities we serve.</p>\n<p>Formed in September 2013, The Mount Sinai Health System combines the excellence of the Icahn School of Medicine at Mount Sinai with seven premier hospital campuses, including Mount Sinai Beth Israel, Mount Sinai Beth Israel Brooklyn, The Mount Sinai Hospital, Mount Sinai Queens, Mount Sinai West (formerly Mount Sinai Roosevelt), Mount Sinai St. Luke’s, and New York Eye and Ear Infirmary of Mount Sinai.</p>\n<p>The Mount Sinai Health System is an equal opportunity employer. We promote recognition and respect for individual and cultural differences, and we work to make our employees feel valued and appreciated, whatever their race, gender, background, or sexual orientation.</p>\n<p>EOE Minorities/Women/Disabled/Veterans</p>\n","how_to_apply":"<p>Apply at: <a href=\"https://careers.mountsinai.org/jobs/2350758?lang=en-us\">https://careers.mountsinai.org/jobs/2350758?lang=en-us</a></p>\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbTFhIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--8d76e21b5b1815a148d61ecb0512b709ef9d4773/mount%20sinai.png"},{"id":"f8d573cb-ddce-4893-94a1-9cee0a9da49d","type":"Full Time","url":"https://jobs.github.com/positions/f8d573cb-ddce-4893-94a1-9cee0a9da49d","created_at":"Fri Dec 21 15:21:37 UTC 2018","company":"American Physical Society","company_url":null,"location":"Ridge","title":"Front End Developer","description":"<p>The American Physical Society, a leading publisher of scientific journals, based in Suffolk County, LI, is seeking a front end developer. This is an exciting opportunity to apply your strong front end development and UX skills to build applications used in all aspects of scientific publishing.</p>\n<p>We’re a group who happily share knowledge and value other ideas, while working in a bright, modern office with a friendly atmosphere and flat hierarchies.</p>\n<p>We will challenge you with interesting work while providing you with a collaborative culture in a fast paced environment.  Our staff is encouraged to attend industry conferences and we are constantly playing with new tools and use all the latest and greatest technologies, affording you the capability to impact all aspects of your projects.</p>\n<p>You must have excellent English communication skills, be a problem solver and a team player, and be results oriented.</p>\n<p>Other incentives for working at APS are great pay, great benefits, generous 403(b), fun company events, commuter benefits, and 3 weeks paid vacation.</p>\n<p>Required Skills</p>\n<ul>\n<li>Expert knowledge of HTML5, CSS3, and associated web standards</li>\n<li>Experience writing modern Javascript (ES6/ES2015, ES2017, Typescript, etc).</li>\n<li>Experience with front-end frameworks such as React or Vue.js</li>\n<li>Experience with modern front-end tooling (Babel, webpack, gulp, parcel, etc.)</li>\n<li>Proficiency in building responsive web applications</li>\n<li>Knowledge of UI/UX design concepts, pattern libraries, style guides, etc.</li>\n<li>Basic command line proficiency (Linux and/or Mac OS X preferred)</li>\n<li>Experience with Git or a similar version control system</li>\n<li>Experience with AWS or similar cloud service providers</li>\n</ul>\n<p>Desired Skills</p>\n<ul>\n<li>Experience doing test driven development with Jest, Jasmine, Mocha/Chai/Sinon, Karma.\nIntegration testing with Selenium.</li>\n<li>Experience with server side development (node.js, express, etc.)</li>\n<li>Basic knowledge of GraphQL</li>\n<li>Experience with additional programming languages (clojurescript, Typescript preferred)</li>\n<li>Accessibility</li>\n</ul>\n<p></p>\n","how_to_apply":"<p>To apply please send your resume to: <a href=\"mailto:recruit@aps.org\">recruit@aps.org</a></p>\n<p>If possible, please also provide code samples and URL's of previous applications you've developed. Candidates who provide links to their GitHub profiles or personal websites with technical articles and/or code samples will receive priority.</p>\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbGhhIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e962cb78bad39586245514b47429b84b958e61e1/APSLogo_2color.gif"},{"id":"a3f15b44-5812-4c99-a878-b4a9cf4dbc66","type":"Full Time","url":"https://jobs.github.com/positions/a3f15b44-5812-4c99-a878-b4a9cf4dbc66","created_at":"Fri Dec 21 13:46:33 UTC 2018","company":"PressCable","company_url":"http://presscable.com","location":"US","title":"Senior Software Developer ","description":"<p>The Role\nWe are a high-growth SAAS provider and international blog network that caters widely to both small to medium businesses and consumers in various niches.</p>\n<p>While our company is a start-up, it is already profitable and continues to grow year on year.</p>\n<p>We've already sold products to over 20,000 customers, supported by a small and talented team (which is where you come in...).</p>\n<p>Primarily we work on building innovative SAAS marketing platforms through a process of creating minimum viable products, and solving problems nobody else on the planet has solved to help online businesses succeed.</p>\n<p>... This leads to an exciting and rapidly evolving development, and being part of a fun, cutting-edge start-up!</p>\n<p>And while our growth and success has so far has been something we're all extremely proud of and excited by...</p>\n<p>... we've now hit a bit of a snag.</p>\n<p>To take things to the next level, we need to expand our team of talented and enthusiastic people to keep the momentum going, keep our customers and users happy - and maintain the excellent quality and value we provide.</p>\n<p>Right now, we're looking to hire a Senior Software Developer to create and maintain the web properties of our core business units. This position will give you an excellent opportunity to take on a wide range of interesting projects and to learn on the job from our talented technology and marketing teams.</p>\n<p>On top of that, we're a very 'dev friendly' company. One of the founders is a developer himself, so we appreciate the need for 'normal hours', flexibility , personal space and to work in flow. We respect ideas, ingenuity, and listen to everyone on our team for insights on how to do things better. We also like to balance the 'cool workin + cool livin' philosophy, so the team blends together nicely, keeps a balance on work &amp; life, communication is open, and it's an overall fun place to work.</p>\n<p>In your role, you'd be reporting to the CTO, and would be a go-to person for our web-related needs. All of our developers handle product development, responding to our marketing team's tech requests and get involved with customer support &amp; IT.</p>\n<p>Product Development involves building out new features for our award-winning flagship software suite, in use by tens of thousands of customers. We use CakePHP as our MVC framework, Vue.js for our front-end, Jenkins to manage our testing &amp; deployment, and Docker/Swarm for environment management. We pride ourselves on writing high-quality code, so we do frequent code inspections, pairs programming, and write lots of automated tests.</p>\n<p>Marketing Technology requests often involve quick turnaround and on-the-fly development as new requirements emerge. So you'd also be setting up setting up dynamic landing pages, implementing the vision of our designers and assisting with social media advertising.</p>\n<p>In addition, all of our developers assist our customer support staff and take care of internal IT assistance. This includes WordPress maintenance, email setup and server maintenance.</p>\n<p>Required Skills:</p>\n<p>5+ years relevant experience working as a software developer\nExpert experience with an MVC framework, an ORM or two, PHP, Javascript + JS frameworks, as well as CSS and its variants\nExperience with TDD, pairs programming, and other Agile/Scrum development techniques\nExperience managing/enhancing WordPress and WP plugins\nExperience working with a high-performing development team that prides itself on writing maintainable, readable &amp; scalable code\nExperience with Git or other similar source control system\nA positive, can-do attitude that is genuine and infectious\nStrong collaboration skills with the ability to document proper requirements for short-term and long-term projects\nWillingness and desire to learn and embrace new web technologies as they evolve\nExcellent Communication and Fluent English</p>\n<p>For our Senior Software Developer position we offer the following benefits:\nThe ability to work from your home office on a full-time basis\nFlexible work time\nObservance of religious holidays\nOpportunity for performance-based bonuses and salary increases</p>\n<p>Interested in applying?</p>\n<p>Please send us an email at <a href=\"mailto:hr@presscable.com\">hr@presscable.com</a> to tell us about your skills and why you would like to work for us, also include your resume. Please don't forget to add \"Senior Software Developer\" in the subject line.</p>\n<p>We really look forward to hearing from you!</p>\n","how_to_apply":"<p>Please send us an email at <a href=\"mailto:hr@presscable.com\">hr@presscable.com</a> to tell us about your skills and why you would like to work for us, also include your resume. Please don't forget to add \"Senior Software Developer\" in the subject line.</p>\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa2RhIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--faee7d214971e38724ef26682bda4520d6e7b53b/Capture.JPG"},{"id":"07b3ce1e-ecbd-11e8-9de2-0e34d5bd5011","type":"Full Time","url":"https://jobs.github.com/positions/07b3ce1e-ecbd-11e8-9de2-0e34d5bd5011","created_at":"Tue Nov 20 12:09:59 UTC 2018","company":"Mindhive","company_url":"http://www.mindhive.org","location":"Brisbane CBD Australia","title":"Senior Front End and Backend Developers","description":"<p><strong>MINDHIVE FRONTEND AND BACKEND DEVELOPER ROLES</strong></p>\n<p>An exciting opportunity exists to work at Mindhive [www.mindhive.org] - the world’s first crowdsourced consultancy. We're looking for an experienced backend developer as part of our core team to take on some of our most demanding challenges to build and create a platform that will improve productivity and in turn change the way Mindhive clients and contributors solve challenges. You will be working closely with the engineering lead and developers in an agile environment with a high degree of freedom.</p>\n<p><strong>Mindhive</strong></p>\n<p>Mindhive sets out to do things differently – we’re taking a unique approach to creating the future of problem solving. The Company's core product is Mindhive - a cloud-based platform where organisational users (who pay) bring challenges to be solved by a growing community of high-quality individual users (non-paying) with a broad range of professional backgrounds and experiences. The model enables organisational users to gather, share and evaluate ideas efficiently and effectively, and gain access to diverse approaches to solving difficult problems. The existing model requires curation and input by administrators and does not take full advantage of the rich data available.</p>\n<p>Since completing a successful capital raising in 2017, the Company has hired a world-class development team [and has partnered with a leading digital design company Joseph Mark] which has given it the capability to develop a more technically complex platform ecosystem-style product (‘Mindhive 2.0’). Mindhive 2.0 will be a revolutionary approach that is ambitious in scale but grounded in historical experience (from the current platform) and growing market appetite for crowdsourcing and artificial intelligence</p>\n<p><strong>SENIOR BACKEND DEVELOPER ROLE</strong></p>\n<p>As a backend developer, you will help design, implement, deploy &amp; support Mindhive’s platform which includes (and not limited to):</p>\n<p>Cloud services\nDatabase\nIntegrations (in-house &amp; third party)\nTests (unit &amp; integration)</p>\n<p><strong>What you’ll do</strong></p>\n<p>Primary responsibility: Implement services (backend API endpoints) for mobile first web apps\nAdditional key responsibilities include:</p>\n<p>Develop cloud-based API services\nDevelop in-house &amp; 3rdparty integration interfaces\nDevelop database models\nImplement automated tests\nDevelop CI/CD scripts\nDevelop performance and monitoring interfaces\nAnalyse business and technical requirements</p>\n<p><strong>What you’ll bring</strong></p>\n<p>Detailed understanding of cloud architecture(s)\nDetailed knowledge of Python &amp; Node.JS\nDetailed knowledge of Django\nDetailed knowledge of Docker\nExperience working with\nPostgres and NoSQL database(s)\nExperience with authentication protocols &amp; certificates\nBonus: detailed knowledge of machine learning &amp; AI</p>\n<p><strong>How do I level up?</strong></p>\n<p>Roles within reach for the employee - Development Team Lead</p>\n<p><strong>Bespoke Requirements / Additional Responsibilities</strong></p>\n<p>Develop and maintain software specifications and architecture documents\nProvide accurate work estimates\nEngage in regular check-ins and follow-up with other developers in the team\nFollow Mindhive’s product development process and methodology</p>\n<p><strong>SENIOR FRONTEND DEVELOPER ROLE OVERVIEW</strong></p>\n<p>As a frontend developer, you will help design, implement, deploy &amp; support Mindhive’s platform which includes (and not limited to):</p>\n<p>Web application\nMobile application\nIntegrations (in-house &amp; third party)\nTests (unit &amp; integration)</p>\n<p><strong>What you’ll do</strong></p>\n<p>Primary responsibility: Implement UX/UI for mobile first web and mobile apps</p>\n<p><strong>Additional key responsibilities include:</strong></p>\n<p>Utilise any and all relevant frameworks, libraries and techniques:</p>\n<p>JavaScript (Vue.js and React Native)\nHTML5, CSS3 and SCSS for design implementations\nLinux Command Line (for bonus points)\nDemonstrate use of modern development practices such as use of Object-Oriented Design, Web Services (REST), Version Control (utilizing Git), Build processes and packaging (Webpack, etc), Automated Testing and Responsive Website Development\nCut up and implement designs\nInform the product team of relevant possibilities and solutions\nDevelop integration with cloud-based API services (in-house &amp; third party)\nReview and inform database models are in alignment with frontend view models &amp; components\nImplement components unit tests and automated tests as required\nDevelop web/site/mobile app performance and monitoring interfaces\nAnalyse business and technical requirements\nMinimise bugs in released code</p>\n<p><strong>What you’ll bring</strong></p>\n<p>Experience with current industry design tools (e.g. Figma)</p>\n<p>Understanding, and preferably experience in, agile project methodology\nYou have experience with version control and project management systems\nCan work and communicate effectively within multidisciplinary teams\nKnowledge of Accessibility and Security Principles\nUndergraduate degree in IT or relevant programming experience\nImpeccable attention to detail\nInnovative thinking and problem solving\nCourteous, supportive and honest\nMotivated self-starter, with the ability to manage your own time and adhere to time and budget restrictions\nEnthusiasm for the work\nMindhive does and your important role in delivery\nCreative thinking &amp; abstract, technical problem solving\nProactivity\nCollaboration</p>\n<p><strong>How do I level up?</strong></p>\n<p>Roles within reach for the employee - Development Team Lead</p>\n<p><strong>Bespoke Requirements / Additional Responsibilities</strong></p>\n<p>Develop and maintain software specifications and architecture documents:\nProvide accurate work estimates\nEngage in regular check-ins and follow-up with other developers in the team\nFollow Mindhive’s product development process and methodology</p>\n","how_to_apply":"<p>Email your resume to <a href=\"mailto:career@mindhive.it\">career@mindhive.it</a></p>\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaUpYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d676c9cb2c7450d84e4d6c615f4a4c9edf6f1627/c540fe15-d18d-48bd-95de-cf0a85125293"},{"id":"02ff2dda-e8e6-11e8-9142-4af8e5c3597d","type":"Full Time","url":"https://jobs.github.com/positions/02ff2dda-e8e6-11e8-9142-4af8e5c3597d","created_at":"Thu Nov 15 14:52:36 UTC 2018","company":"Revive Interior","company_url":null,"location":"Cologne - Germany","title":"Junior Full-Stack Developer (full-time)","description":"<p><strong>Junior Full-Stack Developer (full-time)</strong></p>\n<p>Revive Interior GmbH is an innovative e-commerce company that specializes in reupholstering and selling exclusive used designer furniture. Every step of the process is done inhouse, from buying, reupholstering and photographing up to white-glove fulfillment directly to our customers living-rooms. Our vision is to establish Revive Interior as a globally recognized brand for used furniture and to provide the best alternative for buying new furniture. We strongly believe that small things can have a big impact.\nThis is why we give 10% of our annual profits to charity.</p>\n<p><strong>about the job</strong>\nYou love solving real-world problems in an innovative and long-term way?\nYou accelerate in an almost non-hierarchical, specialized team?\nYou have experience in building scalable software solutions, not forgetting about performance and security?\nYou love to learn new things and like to challenge the status quo?</p>\n<p>Then we want you to join us on our mission!</p>\n<p><strong>your responsibilities</strong></p>\n<ul>\n<li>transform business needs well into code</li>\n<li>working with e-commerce platforms such as WooCommerce &amp; Magento in addition to connecting to other market and distribution places</li>\n<li>working with git will be your daily routine</li>\n</ul>\n<p><strong>your skill</strong></p>\n<ul>\n<li>good understanding of SQL and Relational Databases</li>\n<li>you are experienced in PHP, favorably Laravel</li>\n<li>working with HTML, CSS and JavaScript is your bread and butter</li>\n<li>you understand the basics of TDD</li>\n<li>experience with Linux, Docker, nginx &amp; Vue.js is a bonus</li>\n<li>you are able to communicate well and fast with your team</li>\n</ul>\n<p><strong>we offer</strong></p>\n<ul>\n<li>a small and specialized team in a scaling company with a start-up vibe</li>\n<li>the ability to make your mark in our IT-infrastructure</li>\n<li>daily free lunch cooked by our own chef Erika</li>\n<li>50% discounted JobTicket for public transportation</li>\n</ul>\n<p>Sounds exciting? Don’t hesitate to apply at: <a href=\"mailto:job@reviveinterior.de\">job@reviveinterior.de</a></p>\n<p>We are looking forward to get to know you.</p>\n<p><strong>Contact</strong></p>\n<p>Jessica Aleo</p>\n<p><em>Assistentant of the CEO</em></p>\n<p>Revive Interior GmbH\nOttostraße 3\n50859 Köln-Lövenich</p>\n<p><a href=\"http://www.revive.de\">www.revive.de</a></p>\n","how_to_apply":"<p><a href=\"mailto:job@reviveinterior.de\">job@reviveinterior.de</a></p>\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdVJXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--0d4d0da391b46653d47e1f2a58cf3aaf3e933665/b4e21986-5319-4fd4-850e-79b1b5845db2"},{"id":"dc428b94-e42e-11e8-91e2-23879ca9e8b0","type":"Full Time","url":"https://jobs.github.com/positions/dc428b94-e42e-11e8-91e2-23879ca9e8b0","created_at":"Fri Nov 09 14:51:11 UTC 2018","company":"New York University","company_url":null,"location":"New York, New York 10001","title":"Technology Solutions Developer","description":"<p>As a member of the Technology Development Group, the Technology Solutions Developer is responsible for designing, implementing, and testing a wide variety of web applications, and supporting the School of Law's web presence, including academic and administrative functions. The responsibilities range from designing and developing end-to-end applications, planning and developing new site features, and extending existing applications to keeping web systems up-to-date, and integrating 3rd party applications with the school's application stack. The role requires excellent technical skills, analytical and creative problem solving skills, an ability to work independently or with a group, initiative, and high personal standards for quality work.</p>\n<p>US</p>\n<p>The Technology Development Group at NYU School of Law is a small, versatile, full stack development team. The vast majority of our development is in C#/.NET, with additional projects in PHP (Laravel) … both using Vue as our front-end framework.</p>\n<p>Our group develops and supports the school's website (Drupal), micro sites (usually WordPress), reporting, and administrative applications (both internal and public). We've been known to divert our energies towards improving our supporting infrastructure, and now run many of our services using Docker/Kubernetes/Terraform, and that only as part of our growing AWS presence. We're usually getting ourselves into trouble with interesting projects.</p>\n<p>YOU</p>\n<p>We're looking to add a developer who is flexible enough to code across different environments. Maybe you have experience in another language and are looking to switch it up. You're already good, but want to be better … and you want to learn new things and grow. Regardless, have an opinion, because we genuinely want to hear it!</p>\n<p>WHY</p>\n<p>As an employee of NYU Law, you would receive NYU's benefits (<a href=\"https://www.nyu.edu/employees/benefit.html\">https://www.nyu.edu/employees/benefit.html</a>), including excellent health coverage, retirement plans, and tuition remission. You would be part of a team of creative, talented technologists who continue to make NYU Law one of the top law schools in the country! Finally, you will be given the opportunity to become the professional you want to be, working with the tools you want to work with.</p>\n<p>Required Education:\nBachelor's degree.</p>\n<p>Required Experience:\n2-4 years' experience and expertise in working with high level languages such as: C#, PHP, Python, or Ruby; fluency in HTML, CSS, JavaScript; and familiarity with the general principles of system and network administration; direct experience with the all components of the LAMP stack and content management frameworks, such as Drupal and WordPress.</p>\n<p>Preferred Experience:\nExperience with a web development framework such as: .NET, Laravel, Django, or Rails. Experience with a JavaScript framework such as Vue, Angular, or React.</p>\n<p>Required Skills, Knowledge and Abilities:\nExcellent interpersonal and communication skills; ability and drive to learn new technologies and proactively look for ways to improve the School of Law's applications and web infrastructure.</p>\n<p>Preferred Skills, Knowledge and Abilities:\nKnowledge of module or plugin development for these frameworks is a plus. Fundamental knowledge of distributed version control systems and familiarity with one or more contemporary version control systems (e.g. Git/Mercurial/SVN)</p>\n<p>EOE/AA/Minorities/Females/Vet/Disabled/Sexual Orientation/Gender Identity</p>\n<p>Apply Here: <a href=\"http://www.Click2apply.net/cyg9sy9m99zdm9v2\">http://www.Click2apply.net/cyg9sy9m99zdm9v2</a></p>\n<p>PI105491972</p>\n","how_to_apply":"<p>Apply Here: <a href=\"http://www.Click2apply.net/cyg9sy9m99zdm9v2\">http://www.Click2apply.net/cyg9sy9m99zdm9v2</a></p>\n","company_logo":null},{"id":"9fac9c8c-e27c-11e8-808b-680cc0d53917","type":"Full Time","url":"https://jobs.github.com/positions/9fac9c8c-e27c-11e8-808b-680cc0d53917","created_at":"Wed Nov 07 11:03:36 UTC 2018","company":"Marfeel","company_url":"https://www.marfeel.com/","location":"Barcelona, Spain ","title":"Front-end Jedi","description":"<p>#Who we are:</p>\n<p>Be part of Marfeel, one of the hottest European start-up companies in the mobile ad-tech world. Named as Wired Magazine’s 2015 Top 100 Startups, Inc.5000 nº 1 Fastest Growing Marketing and Advertising Private Company in Spain in 2017, and 16th out of Europe’s 1000 fastest-growing companies by the Financial Times in 2018. We are recommended at the very top by Google itself for our mobile design solution. Together with our partners we have over 6 billion worldwide readers and over 20 billion page views. Our headquarters are based in sunny Barcelona.</p>\n<p>Certified Google Publishing Partner</p>\n<p>Certified Facebook Instant Articles Official Partner</p>\n<p>If you feel like a Front-end Jedi, join the Marfeel Force you must!</p>\n<p>#This is you:</p>\n<ul>\n<li>\n<p>Your life begins and ends with a slash.</p>\n</li>\n<li>\n<p>You feel like you have a mission, not just a task, and you write testable front-end code in JavaScript and HTML/CSS.</p>\n</li>\n<li>\n<p>You understand iterative development and a day without pushing code makes you sad.</p>\n</li>\n<li>\n<p>You’re not afraid to crack open an existing code base and bend it to your will.</p>\n</li>\n<li>\n<p>“Self Starter” is your middle name. You can take or come up with a high-level idea and run with it.</p>\n</li>\n<li>\n<p>You have a real understanding of building products that work at web scale.</p>\n</li>\n<li>\n<p>You can’t imagine your life without a whiteboard, open-source boards and definetly CODE.</p>\n</li>\n<li>\n<p>You know the importance of being part of a universe where all the departments need each other and work together for a mutual goal. So, your communication shows both tech and functional command of what you’re doing.</p>\n</li>\n<li>\n<p>As a software craftsperson you will advocate and practice pair-programming, test-driven development, refactoring, collective-code ownership and continuous integration.</p>\n</li>\n<li>\n<p>You care about online news and user experience.</p>\n</li>\n<li>\n<p>You are an international team player.</p>\n</li>\n<li>\n<p>You are eager for knowledge.</p>\n</li>\n<li>\n<p>You have lots of stamina and you get bored if you have nothing to do.</p>\n</li>\n<li>\n<p>You are hands-on and proactive.</p>\n</li>\n<li>\n<p>You are fluent in English (this is a must).</p>\n</li>\n</ul>\n<p>#Experience:</p>\n<ul>\n<li>\n<p>You can solve technical problems equally well with OO, DOM oriented, or functional JS.</p>\n</li>\n<li>\n<p>You have the ability to create an interface using JavaScript, HTML and CSS.</p>\n</li>\n<li>\n<p>You have a solid understanding of the web technology stack (i.e. headers, cookies, cross-domain restrictions, https, caching, optimization opportunities, hardware acceleration, junk and scroll performance, etc.).</p>\n</li>\n<li>\n<p>You have &gt;2 years experience building software that works at web scale.</p>\n</li>\n<li>\n<p>You have demonstrable experience with cross-browser JS and CSS development. If you also have experience in Java that will be great.</p>\n</li>\n<li>\n<p>You have experience with client-side site development in JS.</p>\n</li>\n<li>\n<p>You have a solid understanding of HTML5 tags - functions and intent.</p>\n</li>\n</ul>\n<p>#We will be impressed if:</p>\n<ul>\n<li>\n<p>You have experience with Webpack, SASS and Jasmine.</p>\n</li>\n<li>\n<p>ReactJS.</p>\n</li>\n<li>\n<p>#perfMatters.</p>\n</li>\n<li>\n<p>Experience with more recent web technologies (i.e. localStorage, geolocation, CSS transitions and transformations).</p>\n</li>\n<li>\n<p>Experience with Google Analytics.</p>\n</li>\n<li>\n<p>Experience with AdServing.</p>\n</li>\n<li>\n<p>You have experience with various AWS services and understand the challenges of deploying large applications in the cloud.</p>\n</li>\n<li>\n<p>Vue.js</p>\n</li>\n</ul>\n<p>#This will be you as part of the Marfeel team:</p>\n<ul>\n<li>\n<p>Working in an international, multicultural and talented team and enjoying our sunny terrace.</p>\n</li>\n<li>\n<p>We have more than 27 nationalities so you will not get lost in translation.</p>\n</li>\n<li>\n<p>Flexible working-time.</p>\n</li>\n<li>\n<p>Free commodities (coffee, tea, juices, etc).</p>\n</li>\n<li>\n<p>Ping-pong, Mario Kart and foosball tournaments.</p>\n</li>\n<li>\n<p>Free language and yoga classes</p>\n</li>\n<li>\n<p>Team building events!</p>\n</li>\n<li>\n<p>Transport, restaurant and kindergarten tickets.</p>\n</li>\n<li>\n<p>Training, books and all you need to feel empowered.</p>\n</li>\n<li>\n<p>And a Referral Bonus if you bring other talented people like you.</p>\n</li>\n</ul>\n","how_to_apply":"<p>Please apply using the following link:</p>\n<p><a href=\"https://marfeel.bamboohr.com/jobs/view.php?id=1\">https://marfeel.bamboohr.com/jobs/view.php?id=1</a></p>\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb1ZXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c47b5b99bafcf0fc28810721fadfe5b059f19cab/5250cec8-bccf-4227-9eea-1b896ac66700"},{"id":"fa15462c-e201-11e8-9ee9-cfbf28397977","type":"Full Time","url":"https://jobs.github.com/positions/fa15462c-e201-11e8-9ee9-cfbf28397977","created_at":"Tue Nov 06 20:25:06 UTC 2018","company":"Constructive","company_url":"http://constructive.co","location":"New York, New York","title":"Sr. Web Developer (Full-Stack/WP), Social Change Design Agency","description":"<p><strong>Sr. Web Developer (Full-Stack/WP), Digital Agency for Social Change</strong></p>\n<p>Constructive, a leading brand experience design &amp; digital design agency that works exclusively with social impact organizations is looking for an outstanding technical expert and creative thinker to join our team as a Sr. Web Developer.</p>\n<p>If you’re an experienced technologist who has demonstrated expertise building Wordpress websites that demand a high degree of creative and technical complexity, thrive on being a collaborative problem solver, and believe that the best digital experiences happen when strategy, technology, and design work together, then we’d love to hear from you. And if you care deeply about issues like climate change, social justice, and economic equality—and want to work on interesting projects that make a meaningful positive impact on them—then we think you’ll love working with us and our clients.</p>\n<p><strong>A bit about the role</strong></p>\n<p>Sr. Web Developers at Constructive need great expertise both in creating powerful back-end publishing systems and in elegant front-end digital experiences. They need to write code that’s semantically sound and adheres to current best practices. They must be proactive thinkers who are always looking to bring new ideas to the table and improve how we work. And they must thrive on working collaboratively in multi-disciplinary teams.</p>\n<p><strong>A bit about us</strong></p>\n<p>We’re a diverse, close-knit bunch who are serious about having fun producing exceptional work. We play to win—for our clients, for ourselves, and for the world. We’ve got each other’s backs. We have high expectations and the work ethic to match them. And we’re all together in the same open office, so there’s music and a lot of joking mixed-in with being heads-down on work.</p>\n<p><strong>A bit about diversity</strong></p>\n<p>We believe strongly that diversity is one of our greatest strengths—that the more perspectives we bring to the mix, the better we are as people and the better partner we are for our clients. So, in considering if Constructive is a good fit for you, know that all we care about is that you’re qualified to do the job, share most or all of our values, and want to be here. These are the things we’ll be evaluating for every applicant.</p>\n<p><strong>What we need you to do extremely well</strong></p>\n<p>We’re looking for a developer who’s eager to play a leading role in Constructive’s digital practice. We’ll need you to have strong demonstrated success having done all or most of the following things for at least 3-5 years—and a passion for doing them extremely well.</p>\n<ul>\n<li>Understand the web development landscape, contributing significantly to creating internal technology strategies that align with broader brand strategy.</li>\n<li>Collaborate across teams to plan and execute ambitious digital projects.</li>\n<li>Develop backend and frontend, taking ownership of your projects from start to finish.</li>\n<li>Participate in QA/UAT testing to ensure that what we deliver is what we promised—and that it lives up to our standards.</li>\n<li>Document your work to make it easier for other developers, both now and in the future, to work with what you’ve built.</li>\n<li>Improve best practices, recommend tools, and build technical frameworks that make our work more efficient, effective, and technically front-of-field.</li>\n<li>Contribute to ongoing development and support for existing websites.</li>\n<li>Contribute to developing proposals and estimates for projects you will be a lead developer.</li>\n<li>Be a team player who has a bias towards listening, takes serious pride in their work, and is always looking for our process and results to be better the next time out.</li>\n<li>Have a sense of humor. Seriously, life can be stressful enough these days.</li>\n</ul>\n<p><strong>Expertise that’s important in our work</strong></p>\n<p>Right now, these are the specific technologies and tasks that are essential to our work (which we always remain open to evaluating and evolving). We’ll need you to have about 5 years of professional experience in most of these things.</p>\n<ul>\n<li>Expert-level Wordpress Development (Min 3 years experience)</li>\n<li>Expert CSS chops (and SCSS!)</li>\n<li>Strong front-end development experience (experience with at least 1 Javascript framework: React, Angular, Vue)</li>\n<li>Strong preprocessor experience (Webpack / Gulp)</li>\n<li>Strong Git experience</li>\n<li>Experience with MySQL</li>\n<li>Experience executing third-party integrations (Salesforce, Mailchimp, Blackbaud, Fluxx, Google Maps API, etc.)</li>\n<li>Comfortable with D3</li>\n<li>Comfortable with AWS</li>\n<li>Comfortable with Server Administration &amp; DevOps</li>\n</ul>\n<p><strong>What’s in it for you?</strong></p>\n<p>We do our best to make sure everyone at Constructive is taken care of with a great mix of salary, benefits and perks, opportunities for professional growth, and a healthy dose of time off. We also always reward individual initiative and outsized contributions to our collective success. Along with your base salary, here are the benefits and perks we have on tap at Constructive for 2018-2019 to add to this:</p>\n<p><strong>Benefits &amp; Perks</strong></p>\n<ul>\n<li>Health, Dental &amp; Vision Insurance</li>\n<li>401K plan with 4% company match</li>\n<li>Annual profit sharing bonus+performance bonuses (no less than 10% of company profit split equally by all employees as profit sharing)</li>\n<li>2 weeks paid vacation (+1 additional day per year)</li>\n<li>Paid vacation between Christmas &amp; New Year's</li>\n<li>1/2-day Summer Fridays (Approx 16 days)</li>\n<li>1 week paid personal/sick days</li>\n<li>Unlimited work-from-home days (within reason!) after 6 months</li>\n<li>Monthly employee-voted gift card awards</li>\n<li>TransitChek (pay for transit w/ pre-tax $)</li>\n<li>Discounted Company Cell Phone Plan</li>\n<li>$1K annual professional development stipend</li>\n<li>New client bonus (2.5% of largest contract in year 1 for any non-inbound client)</li>\n<li>Coffee, healthy snacks, soda</li>\n<li>Company lunch every Wednesday</li>\n<li>Weekly Happy Hr (every non-summer Friday)</li>\n<li>Bi-monthly Company Events (sporting events, bowling, holiday party, etc)</li>\n<li>The feeling of satisfaction knowing that your work is helping make the world a better place.</li>\n</ul>\n<p><strong>Interested? Great! Then please send an email to titled “Senior Web Developer” to <a href=\"mailto:jobs@constructive.co\">jobs@constructive.co</a> with the following</strong></p>\n<ul>\n<li>A resume</li>\n<li>A cover letter telling us a bit about you and what excites you about joining our team</li>\n<li>Links to your own website, websites you’ve worked on, github, whatever\nDesired salary (freelance rate for those interested in consulting with us)</li>\n</ul>\n","how_to_apply":"<p>Interested? Great! Then please send an email to titled “Senior Web Developer” to <a href=\"mailto:jobs@constructive.co\">jobs@constructive.co</a> with the following</p>\n","company_logo":null},{"id":"cdd3b306-ded1-11e8-9d57-a9ea0396f64e","type":"Full Time","url":"https://jobs.github.com/positions/cdd3b306-ded1-11e8-9d57-a9ea0396f64e","created_at":"Fri Nov 02 19:02:51 UTC 2018","company":"Jun Group","company_url":"https://www.jungroup.com/","location":"New York, NY","title":"Senior Software Developer, Server-Side Technologies","description":"<p>The word JUN means truth, and our culture is about openness and honesty. Our mobile ad platform delivers millions of engagements across devices for clients like Intel, LG, Zynga, EA, and TechCrunch. These brands rely on us to reach their audience because everything we do is brand safe, viewable, and transparent.</p>\n<p>We are looking for a senior software engineer to join our amazing server team. This position is full-time, on-site in our New York headquarters, and will report to the Director of Server Software Development. Jun Group will only consider candidates for this position who are currently legally authorized to work in the United States.</p>\n<p>Who you are</p>\n<ul>\n<li>You enjoy a fun, creative, and engaging working atmosphere free of brilliant jerks</li>\n<li>You want to be part of a small team inside a large company with massive opportunity for growth</li>\n<li>You enjoy collaboration with other teams including product, biz dev, and our in-house QA team</li>\n<li>You eagerly dig into complex engineering problems</li>\n</ul>\n<p>What we do</p>\n<ul>\n<li>Write scalable back-end and front-end code in JRuby, Java, and JavaScript</li>\n<li>Experiment with new tech to find the right tool for the job</li>\n<li>Maintain high code quality through code reviews and automated tests</li>\n<li>Use Kanban to manage multiple releases per week\n-Participate in and improve Dev Ops for our primary revenue generating applications</li>\n</ul>\n<p>How we do it</p>\n<ul>\n<li>Ruby/Rails</li>\n<li>JavaScript (JQuery, AngularJS, Vue.js)</li>\n<li>IntelliJ IDEA / TeamCity</li>\n<li>AWS (EC2, EB, RDS)</li>\n<li>Google Cloud (BiqQuery, Dataflow, Cloud Functions)</li>\n<li>MySQL</li>\n</ul>\n<p>What we offer</p>\n<ul>\n<li>A highly competitive compensation package</li>\n<li>401k with company match</li>\n<li>Paid vacation, work from home, and sick days</li>\n<li>Annual personal development budget to attend a conference of your choice</li>\n<li>Designated time to work on the company-related projects you feel strongly about</li>\n<li>Macbook Pros, dual monitors, and a quiet working space</li>\n<li>Catered lunch at least once a week</li>\n<li>Monthly company events</li>\n</ul>\n<p>Jun Group sets the standard for premium online advertising. We work hard, and we have lives, too. We'll pay top dollar for the right person, and there are plenty of perks. Interested parties should send a resume along with a cover note explaining why you’re right for the job.</p>\n<p>Total compensation is based on experience. We welcome diversity and non-traditional paths into the developer profession, and advocate strongly for hiring the right person as opposed to the right combination of keywords.</p>\n","how_to_apply":"<p><a href=\"https://grnh.se/06736d9f2\">https://grnh.se/06736d9f2</a></p>\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbFZXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b7b6ff567161ab42ea425d31b38f5aae7420f2aa/f1729282-ab89-4940-8f76-77e7ad8e1cae"},{"id":"2d215050-dea2-11e8-9a31-2431d393de1e","type":"Full Time","url":"https://jobs.github.com/positions/2d215050-dea2-11e8-9a31-2431d393de1e","created_at":"Fri Nov 02 13:22:25 UTC 2018","company":"Aera Technology","company_url":"https://www.aeratechnology.com/careers","location":"Bucharest","title":"Senior User Interface Software Engineer","description":"<p>Do you want to shape the future of enterprise software?</p>\n<p>At Aera Technology, we apply Internet scale technology to the challenges facing enterprise businesses. Think of the self-driving car: connected, always-on, thinking, and autonomous. Our mission is to enable companies in the same way.</p>\n<p>We're hiring exceptionally talented UI developers to join our top-notch engineering team. This is a great opportunity to be part of a team developing cutting-edge enterprise cloud platform. You must be highly motivated, independent, result oriented and enjoy working in a start-up atmosphere.</p>\n<p><strong>Responsibilities</strong></p>\n<ul>\n<li>Develop new features and components in our existing web application.</li>\n<li>Build reusable code and libraries for future use.</li>\n<li>Work with PM and UX designer to understand the requirement and ensure the technical feasibility of UI/UX design.</li>\n<li>Optimize application for maximum speed and scalability.</li>\n<li>Learn and research latest JavaScript frameworks and work on PoC projects to integrate and upgrade existing application.</li>\n<li>Collaborate with other team members and with cross-functional teams and stakeholders across geographies.</li>\n<li>Create and execute unit test cases and contribute to test automation.</li>\n<li>Participate in design and code reviews.</li>\n</ul>\n<p><strong>About You</strong></p>\n<ul>\n<li>A passion for UI/UX</li>\n<li>You are an experienced UI developer with a proven track record of delivering great software.</li>\n<li>Experience with HTML, CSS, HTML5, OO Javascript, modern frameworks such as ReactJS, Polymer, VueJS or ExtJS/Sencha.</li>\n<li>Experience with NodeJS, Browserify, Babelify, Gulp, Bower.</li>\n<li>An ability to write code for responsive UI and implement common widgets.</li>\n<li>Have a passion for quality and writing clean, solid, readable code that scales and performs well.</li>\n<li>A firm grasp of Computer Science fundamentals including object-oriented design, data structures, algorithm design, problem-solving, and complexity analysis.</li>\n<li>Experience with Java, Rest API is a big plus.</li>\n<li>Experience with cloud services. Experience with microservices would be a bonus.</li>\n<li>An urge to collaborate with other architects, designers, product managers, and software developers to influence product direction and functional requirements.</li>\n<li>Ability to coach and collaborate inside and outside the team - You enjoy working closely with others, teaching, and learning, and are comfortable showing off your work.</li>\n<li>Have a positive energy and enthusiasm - cultural fit is a big deal for us, we’re looking for smart people who are excited about solving big problems and are self-motivated to get things done.</li>\n<li>Are highly organized and have a professional attitude towards work - You're an exceptional communicator, you are pragmatic, and you know how to build trust.</li>\n</ul>\n<p>At Aera, we're on a mission to solve the biggest, most intractable challenges of enterprise software. We envision the rise of the Self-Driving Enterprise: a more autonomously functioning business with a central operating system that connects and orchestrates business operations. Our platform is increasingly used by the world's largest companies to identify and respond to market opportunities faster.</p>\n<p>If you share our passion for building the next generation of enterprise software and implementing it for the most sophisticated customers in the world, you’ve met your match. Headquartered in Mountain View, California, we're growing fast, with teams in Mountain View and San Francisco (California), Portland (Oregon), Bucharest and Cluj-Napoca (Romania), Paris (France), Munich (Germany), London (UK), Pune (India), and Sydney (Australia).  So join us, and let’s build this!</p>\n","how_to_apply":"<p>Apply here: <a href=\"https://bit.ly/2Jx6mmO\">https://bit.ly/2Jx6mmO</a></p>\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbE5XIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--fba17a4ed559f551edc9e347e837356588da5ce8/d676ca56-df82-4c76-8f5e-bd7778190625"},{"id":"c37e8b54-d555-11e8-8730-c2f34a443e55","type":"Full Time","url":"https://jobs.github.com/positions/c37e8b54-d555-11e8-8730-c2f34a443e55","created_at":"Sun Oct 21 17:25:33 UTC 2018","company":"DevsData","company_url":null,"location":"Oslo, Norway","title":"Senior Full-Stack JavaScript Engineer/Tech Lead with Node, React & TypeScript","description":"<h2>[Senior Full-Stack JS Engineer/Tech Lead with Node &amp; React needed!]</h2>\n<p>Join the team of ex-Googlers!</p>\n<ul>\n<li>Full-time (40h a week)</li>\n<li>Location: Oslo, Norway (relocation required)</li>\n<li>$70 - $140 an hour</li>\n<li>Duration: 12+ months (permanent employment / long-term contract)</li>\n<li>Start: beginning of December 2018 (negotiable)</li>\n<li>3-4 people with this profile are needed</li>\n<li>Accommodation cost in Oslo is covered by the company</li>\n</ul>\n<p>Yet another time we search for extraordinary specialists to join our nerdy crew! :)</p>\n<p>Project for a big retail corporation in Norway (12k employees) with stores across entire Europe.</p>\n<p>You’ll be working closely with business people (including ex-McKinsey partner with 20 years of business experience; Harvard graduate), IT specialists (SE architects, DevOps, UI/UX people), marketing/sales department, Machine Learning/Artificial Intelligence professionals, QA, logistics department and product manager to design, prioritize, and build new IT products in fashion, retail/e-commerce sectors related to a digital transformation that is happening in the organization.</p>\n<p>One of the most important products that will need to be build is a new ecommerce platform (think: Zalando competitor) as well as information/data exchange platform for physical stores and IT tools for supply chain optimisation.</p>\n<p>The role is a fast-paced environment that involves above-average degree of tech &amp; business conceptual thinking, swiftness, communication &amp; people skills and ecommerce/retail understanding. Ideal candidate can present a work history for well-known brands, some startup world experience (we’re lean and move quickly), min 2 years of similar commercial experience on a similar position.</p>\n<p>If you are looking for an easy next project/job, or quick cash - there are better offers out there.</p>\n<p>Basic algorithmic experience and problem solving absolutely required - if you're strong in JS/React, but struggle at algo or data structures, don't bother applying.</p>\n<p>A rare, exciting opportunity to hone industry-related, practical business know-how, system design skills and work/network with top-notch world-class professionals (we already relocated people from the US and Canada for this project; people with Harvard and Google on their CVs).</p>\n<p>Initial tech stack (likely to be refined, but not totally changes):\n️- Front-End: JS, TypeScript, React, Vue, MobX.js, Redux, Web Assembly, Sharing components, PWA, Jest, Mocha, Karma\n️- Back-End: mainly - NodeJS and serverless, but also: GoLang, Python, grpc, RabbitMQ, Celery, Redis, Nginx*, HAProxy, Varnish HTTP cache\n️- DevOps: Kubernetes, Ansible, Docker, Prometheus, Grafana, ELK, Fluentd, Collectd, Terraform, Helm, New Relic, Sentry, secret management tools, InfluxDB, Telegraf, Swagger*\n️- FaaS: OpenFaas, Serverless, AWS Lambda*, Fission, Syncano</p>\n<p>The most important are: JS, TypeScript, React &amp; Node</p>\n<p>Requirements</p>\n<p>️- Previous involvement in building large IT product totally from scratch</p>\n<p>️- Wide-range of technologies that you're comfortable using (ideally covering majority of tools mentioned in this offer, and especially strong in JS environments including Node and React)</p>\n<p>️- Minimum 1 year of professional experience on commercial projects and similar position (tech lead / senior FE/JS engineer)</p>\n<p>️- Minimum 7 years of commercial, hands-on IT experience in total</p>\n<p>️- International experience</p>\n<p>️- Fluent English communication skills</p>\n<p>️- Being up to date with recent tech tools &amp; frameworks, extensive overall IT knowledge</p>\n<p>️- Willingness to relocate to Oslo</p>\n<p>Big pluses:</p>\n<p>️- Studied Computer Science at a prestigious university - e.g. Harvard, Oxford, Cambridge, MIT, Stanford, Wharton, Berkeley (or top universities in your country)</p>\n<p>️- Worked or contracted to well-know brands and corporations e.g. Google, Palantir, Hedge Funds, Amazon, eBay, Microsoft, Goldman Sachs (joking, GS is actually a minus :)), Intel, Nvidia</p>\n<p>️- Work experience also from the fast-paced startup world</p>\n<p>️- Worked with a distributed/remote team before</p>\n<ul>\n<li>\n<p>Excellent communication skills</p>\n</li>\n<li>\n<p>Business understanding / product skills</p>\n</li>\n</ul>\n<p>️- If you consider yourself a nerd :) and are passionate about the technology, that's a big plus</p>\n","how_to_apply":"<p><a href=\"mailto:tomasz@potanski.pl\">tomasz@potanski.pl</a></p>\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc3hYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ec6a6dbf94a850ad67f2c4067360ba2f25b2b2e5/24236f93-1354-4eef-9265-ef08a743ba6b"}]
